Revit 2024 API
TextRange.End Property
 The index of the first character after the end of the range
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public int End { get; }
Visual Basic
Public ReadOnly Property End As Integer
	Get
Visual C++
public:
property int End {
	int get ();
}
See Also
TextRange Class
Autodesk.Revit.DB Namespace